Public Attributes | List of all members
API_RegularizedPoly Struct Reference
Polygons
Structure for regularizing polygon or polyline. More...
#include <APIdefs_Goodies.h>
 Public Attributes
API_Coord **  | coords
Coordinate array.
Int32 **  | pends
Polygon endpoints; see API_Polygon for more information.
API_PolyArc **  | parcs
Polygon arcs; see API_PolyArc and API_Polygon for more information.
UInt32 **  | vertexIDs
Unique identifiers the polygon vertices (unique inside the polygon). Optional.
UInt32 **  | edgeIDs
Unique identifiers the polygon edges (unique inside the polygon). Optional.
UInt32 **  | contourIDs
Unique identifiers the polygon contours (unique inside the polygon). Optional.
bool  | needVertexAncestry
Set to true if you would like to receive vertex ancestry after regularization. Input only parameter.
Int32 **  | vertexAncestry
Array holding the indices of the vertices in the original polygon. Output only parameter. The array is filled only if it was requested with the needVertexAncestry parameter. The index value is 0 in case of new vertices. There is an index for all vertices. The array is indexed from 1.
bool  | needEdgeAncestry
Set to true if you would like to receive edge ancestry after regularization. Input only parameter.
Int32 **  | edgeAncestry
Array holding the indices of the edges in the original polygon. Output only parameter. The array is filled only if it was requested with the needEdgeAncestry parameter. The index value is 0 in case of new edges. There is an index for all edges. The array is indexed from 1.
bool  | needContourAncestry
Set to true if you would like to receive contour ancestry after regularization. Input only parameter.
Int32 **  | contourAncestry
Array holding the indices of the contours in the original polygon. Output only parameter. The array is filled only if it was requested with the needContourAncestry parameter. The index value is 0 in case of new contours. There is an index for all contours. The array is indexed from 1.
Detailed Description
Structure for regularizing polygon or polyline.
Remarks
This structure is used to regularize a polygon or a polyline. ACAPI_Polygon_RegularizePolygon and ACAPI_Polygon_RegularizePolyline goody functions use this as input and output.
Member Data Documentation
◆ contourAncestry
 API_RegularizedPoly::contourAncestry
Array holding the indices of the contours in the original polygon. Output only parameter. The array is filled only if it was requested with the needContourAncestry parameter. The index value is 0 in case of new contours. There is an index for all contours. The array is indexed from 1.
◆ contourIDs
 API_RegularizedPoly::contourIDs
Unique identifiers the polygon contours (unique inside the polygon). Optional.
◆ coords
 API_RegularizedPoly::coords
Coordinate array.
◆ edgeAncestry
 API_RegularizedPoly::edgeAncestry
Array holding the indices of the edges in the original polygon. Output only parameter. The array is filled only if it was requested with the needEdgeAncestry parameter. The index value is 0 in case of new edges. There is an index for all edges. The array is indexed from 1.
◆ edgeIDs
 API_RegularizedPoly::edgeIDs
Unique identifiers the polygon edges (unique inside the polygon). Optional.
◆ needContourAncestry
 API_RegularizedPoly::needContourAncestry
Set to true if you would like to receive contour ancestry after regularization. Input only parameter.
◆ needEdgeAncestry
 API_RegularizedPoly::needEdgeAncestry
Set to true if you would like to receive edge ancestry after regularization. Input only parameter.
◆ needVertexAncestry
 API_RegularizedPoly::needVertexAncestry
Set to true if you would like to receive vertex ancestry after regularization. Input only parameter.
◆ parcs
 API_RegularizedPoly::parcs
Polygon arcs; see API_PolyArc and API_Polygon for more information.
◆ pends
 API_RegularizedPoly::pends
Polygon endpoints; see API_Polygon for more information.
◆ vertexAncestry
 API_RegularizedPoly::vertexAncestry
Array holding the indices of the vertices in the original polygon. Output only parameter. The array is filled only if it was requested with the needVertexAncestry parameter. The index value is 0 in case of new vertices. There is an index for all vertices. The array is indexed from 1.
◆ vertexIDs
 API_RegularizedPoly::vertexIDs
Unique identifiers the polygon vertices (unique inside the polygon). Optional.